[{"model": "blog.comment", "pk": 1, "fields": {"creator": 1, "content": "what a great day", "content_type": 8, "object_id": 1, "created_at": "2024-01-23T22:20:19.021Z", "modified_at": "2024-01-23T22:20:19.043Z"}}, {"model": "blog.comment", "pk": 2, "fields": {"creator": 1, "content": "coment on an author", "content_type": 4, "object_id": 1, "created_at": "2024-01-23T22:20:19.021Z", "modified_at": "2024-01-23T22:20:19.043Z"}}, {"model": "blog.comment", "pk": 3, "fields": {"creator": 1, "content": "comment 1 to post 1", "content_type": 8, "object_id": 1, "created_at": "2024-02-08T22:25:27.039Z", "modified_at": "2024-02-08T22:25:27.039Z"}}, {"model": "blog.comment", "pk": 4, "fields": {"creator": 1, "content": "comment 2 to post 1", "content_type": 8, "object_id": 1, "created_at": "2024-02-08T22:40:56.246Z", "modified_at": "2024-02-08T22:40:56.246Z"}}, {"model": "blog.tag", "pk": 1, "fields": {"value": "django"}}, {"model": "blog.tag", "pk": 2, "fields": {"value": "deploy django"}}, {"model": "blog.tag", "pk": 3, "fields": {"value": "django logging"}}, {"model": "blog.post", "pk": 1, "fields": {"author": 1, "created_at": "2024-01-19T22:21:27.428Z", "modified_at": "2024-01-19T22:21:27.428Z", "published_at": "2024-01-19T22:24:15Z", "title": "post1 title", "slug": "post1-title", "summary": "post1 summary", "content": "post1 content", "tags": [1]}}, {"model": "blog.post", "pk": 2, "fields": {"author": 1, "created_at": "2024-01-25T10:50:57.072Z", "modified_at": "2024-01-25T10:50:57.072Z", "published_at": "2024-01-25T10:51:07Z", "title": "How to build a blog application with Django:", "slug": "how-to-build-a-blog-application-with-django", "summary": "Steps to build a blog application with Django", "content": "- Pre-Requirements: Before we start, make sure you have Python 3 installed on your machine. You can follow the instructions provided in 1 to install Python 3. Also, create and activate a virtual environment for your project. You can refer to 1 for instructions on how to create and activate a virtual environment.\r\n\r\n-Installing Django: Once you have created and activated your virtual environment, you can install Django by running the following command: pip install Django. You can refer to 1 for more information.\r\n\r\n- Setting up the Project: After installing Django, you can create a new Django project by running the following command: django-admin startproject myproject. You can replace myproject with the name of your project. You can refer to 1 for more information.\r\n\r\n- Creating the Blog Application: Once you have created your project, you can create a new Django application by running the following command: python manage.py startapp blog. You can replace blog with the name of your application. You can refer to 1 for more information.\r\n\r\n- Creating the Models: After creating your application, you can create the models for your blog by defining the fields for your blog posts. You can refer to 1 for more information.\r\n\r\n- Creating the Views: Once you have defined your models, you can create the views for your blog by defining the functions that will handle the requests and return the responses. You can refer to 1 for more information.\r\n\r\n- Creating the Templates: After creating your views, you can create the templates for your blog by defining the HTML files that will be rendered by your views. You can refer to 1 for more information.\r\n\r\n- Creating the URLs: Finally, you can create the URLs for your blog by defining the URL patterns that will map the requests to the appropriate views. You can refer to 1 for more information.", "tags": [1]}}, {"model": "blog.post", "pk": 3, "fields": {"author": 1, "created_at": "2024-01-25T10:54:07.714Z", "modified_at": "2024-01-25T10:54:07.714Z", "published_at": "2024-01-25T10:56:18Z", "title": "How to deploy the Django blog to a server", "slug": "how-to-deploy-the-django-blog-to-a-server", "summary": "Steps to deploy your Django blog to a server,", "content": "Choose a hosting provider: There are many hosting providers available that support Django applications. Some popular options include Heroku, PythonAnywhere, and DigitalOcean. You can refer to 1 for more information.\r\n\r\nCreate a new server: Once you have chosen a hosting provider, you can create a new server instance. The process for creating a new server will vary depending on the hosting provider you choose. You can refer to the documentation provided by your hosting provider for more information.\r\n\r\nInstall the required dependencies: After creating your server, you need to install the required dependencies for your Django application. This includes installing Python, Django, and any other packages that your application depends on. You can refer to 1 for more information.\r\n\r\nConfigure your server: Once you have installed the required dependencies, you need to configure your server to run your Django application. This includes setting up your database, configuring your web server, and configuring your application settings. You can refer to 1 for more information.\r\n\r\nDeploy your application: After configuring your server, you can deploy your Django application to your server. This includes copying your application files to your server, setting up your static files, and running your application. You can refer to 1 for more information.", "tags": [1, 2]}}, {"model": "blog.post", "pk": 4, "fields": {"author": 1, "created_at": "2024-02-08T21:03:00.485Z", "modified_at": "2024-02-08T21:03:00.485Z", "published_at": "2024-02-08T21:03:11Z", "title": "Logging in Django", "slug": "logging-in-django", "summary": "Short info about logging in Django", "content": "Django provides a built-in logging module that can be configured to handle various levels of messages. Logging is useful for tracking the performance, errors, and security of your web application. To use logging in Django, you need to import the logging module and create a logger object. Then, you can use the logger methods to write messages to the log files or the console .", "tags": [2, 3]}}, {"model": "blango_auth.user", "pk": 1, "fields": {"password": "argon2$argon2id$v=19$m=102400,t=2,p=8$TnowOEFSVjVtcFlpakY5NW5DeDVuZw$uxFKyVCXFP3+Ha5XFPolxw", "last_login": "2024-02-11T21:28:07.291Z", "is_superuser": true, "username": "codio", "first_name": "", "last_name": "", "email": "codio@a.com", "is_staff": true, "is_active": true, "date_joined": "2024-01-18T23:16:17.357Z", "groups": [], "user_permissions": []}}]